{
  "header": {
    "role": "Senior Frontend Developer"
  },
  "academic": {
    "title": "Academic Background",
    "masters": "Master in High Performance Web Programming",
    "degree": "Degree in Business and Technology"
  },
  "experience": {
    "title": "Professional Experience",
    "tasks": "Tasks",
    "projects": "Projects",
    "methodologies": "Methodologies",
    "stack": "Stack",
    "senior_title": "Senior Frontend Developer",
    "senior_tasks": "Conduct technical analysis and provide accurate effort estimations. Define architecture improvements focused on scalability and maintainability, establish team-wide best practices, and introduce automated linting and formatting workflows using ESLint and Prettier. Manage progressive Angular upgrades from v17 through v20, coordinating updates to LTS releases.",
    "senior_projects": "Contributed to internal initiatives including: WebSetup — a web dashboard for configuring EV chargers; a touch-screen web application deployed on company chargers to manage user charging workflows; a middleware service integrating the backend with charger UI applications; and a Circutor migration project to replace SCADA with a Grafana-based web solution for charger data management.",
    "fullstack_title": "Fullstack Developer",
    "fullstack_tasks": "Hold client meetings, Create and maintain Angular projects, Technical analysis, Development time estimation, Testing",
    "fullstack_projects": "OVT (Virtual Procedures Office) for Barcelona City Council; SEAT — Java application managing vehicle campaign states and mobilization lifecycle from production to dealerships",
    "frontend_title": "Frontend Developer",
    "freelance_title": "Freelance Front-End Developer",
    "trainee_title": "IT Risk Advisory Assistant (Trainee)",
    "common_methods": "Agile, Scrum",
    "senior_stack": "Angular (up to v20 LTS), RxJS, Signals, NestJS, ESLint, Prettier, HTML5, CSS3, JavaScript, TypeScript, PrimeNG, Git, Jest",
    "fullstack_stack": "Angular, HTML5, CSS3, JavaScript, TypeScript, Material, Bootstrap, Java, Spring Boot, SQL, GSAP",
    "frontend_stack": "Angular, HTML5, CSS3, JavaScript, TypeScript, Material, Jira, GSAP",
    "freelance_stack": "Angular, Sanity, HTML5, CSS3, JavaScript, TypeScript, Bootstrap, GSAP",
    "trainee_tasks": "Technological risks analysis, Hold client meetings, Prepare PowerPoint presentations, Create Excel documents with macros",
    "trainee_projects": "Analysis of Banco Sabadell's main technological risks"
  },
  "languages": {
    "title": "Languages",
    "spanish": "Spanish",
    "catalan": "Catalan",
    "english": "English",
    "native": "Native",
    "english_level": "C1 (Cambridge English Advanced)"
  },
  "stack": {
    "title": "Stack",
    "frontend_list": "Angular (up to v20 LTS), RxJS, Signals, PrimeNG, HTML5, CSS3, JavaScript, TypeScript",
    "backend": "Backend / Tools",
    "testing": "Testing / QA",
    "devops": "DevOps / Monitoring"
  },
  "projects": {
    "title": "Last Public Projects",
    "sunio": {
      "desc": "A simple web-based expense sharing app. No downloads, no accounts, and no registration required. Designed to quickly split and track shared expenses in an easy and practical way."
    },
    "basis": {
      "desc": "A headless Angular component library. It is split into two packages: Primitives, which provides unstyled base components, and Styles, a Tailwind-based layer that integrates seamlessly with custom themes and design systems."
    },
    "ahead": {
      "desc": "A web platform for a recruiting company, combining a corporate presentation site with a job listings section. It includes a dashboard to manage offers and showcase the company’s services in a clear and professional way."
    }
  },
  "footer": {
    "download": "Download CV as PDF"
  },
  "alt": {},
  "aria": {
    "download": "Download CV as PDF"
  },
  "experience_extra": {
    "fullstack_seat_extra": "SEAT — Java application managing vehicle campaign states and mobilization lifecycle from production to dealerships",
    "trainee_tools": "Excel, PowerPoint"
  }
}
